//============================================================
//
//  title  : 双方向リストクラス [doublyLinkedList.h]
//  Author : 原田 陽央
//   Date  : 2021/10/07
//  Update : 2021/10/07
//
//============================================================
#pragma once


//============================================================
//　インクルード
//============================================================
#include <iostream>
#include <string>
using namespace std;


//============================================================
//　構造体宣言
//============================================================
// 成績データ構造体
struct RecordData
{
	int score;        // スコア
	string userName;  // ユーザー名
};


//============================================================
//　クラス宣言
//============================================================
class DoublyLinkedList
{
public:
	// ノード構造体
	struct Node
	{
		Node* prevPtr;         // 前のノードへのポインタ
		Node* nextPtr;         // 次のノードへのポインタ

		RecordData recordData; // 成績データ
	};


	// データ数の取得

	// データの挿入

	// データの削除

	// 先頭イテレータ取得

	// 先頭コンストイテレータ取得

	// 末尾イテレータ取得

	// 末尾コンストイテレータ取得

private:
	// ノードへのポインタ
	Node* ptr;
};