//============================================================
//
//  title  : イテレータクラス [iterator.h]
//  Author : 原田 陽央
//   Date  : 2021/10/07
//  Update : 2021/10/07
//
//============================================================
#pragma once


//============================================================
//　インクルード
//============================================================
#include "doublyLinkedList.h"
#include "constIterator.h"


//============================================================
//　クラス宣言
//============================================================
class Iterator : ConstIterator
{
public:
	
	// イテレータの指す要素を取得する
	//DoublyLinkedList::Node* GetIteratorNode(void)
	//{
	//	return thisPtr;
	//}
};